"""Вам предоставлен словарь соответствия символов строки коду азбуки Морзе.
Напишите функцию morse_decode(), которая принимает словарь с азбукой Морзе и строку в виде азбуки Морзе и возвращает декодированное слово. Символы в закодированной строке разделены пробелами."""

morse = {"0": "-----", "1": ".----", "2": "..---", "3": "...--", "4": "....-", "5": ".....", "6": "-....",
             "7": "--...", "8": "---..", "9": "----.", "a": ".-", "b": "-...", "c": "-.-.", "d": "-..", "e": ".",
             "f": "..-.", "g": "--.", "h": "....", "i": "..", "j": ".---", "k": "-.-", "l": ".-..", "m": "--",
             "n": "-.", "o": "---", "p": ".--.", "q": "--.-", "r": ".-.", "s": "...", "t": "-", "u": "..-",
             "v": "...-", "w": ".--", "x": "-..-", "y": "-.--", "z": "--..", ".": ".-.-.-", ",": "--..--",
             "?": "..--..", "!": "-.-.--", "-": "-....-", "/": "-..-.", "@": ".--.-.", "(": "-.--.", ")": "-.--.-"}

def morse_decode(morse, word = ""):
    sep_word = word.split()
    print(sep_word)
    decode_word = []
    for elem in sep_word:
        for char, char_morse in morse.items():
            if char_morse == elem:
                decode_word.append(char)

    return ''.join(decode_word)

print(morse_decode(morse, "--. .- -- ."))